from tkinter import *
import functools


score = 0
from functools import partial

root = Tk()
root.title("ตรวจคุณภาพชีวิต")


question = IntVar(value=0)
q = [
    "ท่านพอใจกับสุขภาพของท่านในตอนนี้เพียงใด",
    "การเจ็บปวดตามร่างกายเช่น ปวดหัว ปวดท้อง ปวดตามตัว ทําให้ท่านไมสามารถทำในสิ่งทิ่ต้องการมากน้อยเพียงใด",
    "ท่านมีกําลังเพียงพอที่จะทําสิ่งต่างๆในแต่ละวันไหมทั้งเรื่องงาน หรือการดําเนินชีวิตประจําวัน",
    "ท่านพอใจกับการนอนหลับของท่านมากน้อยเพียงใด",
    "ท่านรู้สึกพึงพอใจในชีวิต (เช่น มีความสุข ความสงบ ความหวัง) มากน้อยเพียงใด",
    "ท่านมีสมาธิในการทำงานต่างๆ ดีเพียงใด",
    "ท่านรู้สึกพอใจในตนเองมากน้อยแค่ไหน",
    "ท่านยอมรับรูปร่างหน้าตาของตัวเองได้ไหม",
    "ท่านมีความรู้สึกไม่ดีเช่น รู้สึกเหงาเศร้า หดหู่ สิ้นหวังวิตกกังวล บ่อยแค่ไหน",
    "ท่านรูู้สึกพอใจมากน้อยแค่ไหนที่สามารถทําอะไรๆผ่านไปได้ในแต่ละวัน",
    "ท่านจําเป็นต้องไปรับการรักษาพยาบาลมากน้อยเพียงใดเพื่อที่จะทํางานหรือมีชีวิตอยู่ไปได้ในแต่ละวัน",
    "ท่านพอใจกับความสามารถในการทำงานได้อย่างที่เคยทํามามากน้อยเพียงใด",
    "ท่านพอใจต้องการผูกมิตรหรือเข้ากับคนอื่นอย่างที่ผ่านมาแค่ไหน",
    "ท่านพอใจกับการช่วยเหลือที่เคยได้รับจากเพือน ๆแค่ไหน",
    "ท่านรู้สึกว่าชีวิตมีความมั่นคงปลอดภัยดีไหมในแต่ละวัน",
    "ท่านพอใจกับสภาพบ้านเรือนที่อยู่ตอนนี้มากน้อยเพียงใด",
    "ท่านมีเงินพอใช้จ่ายตามความจําเป็นมากน้อยเพียงใด",
    "ท่านพอใจที่จะสามารถไปใช้บริการสาธารณสุขได้ตามความจําเป็นเพียงใด",
    "ท่านได้รู้เรื่องราวข่าวสารที่จําเป็นในชีวิตแต่ละวันมากน้อยเพียงใด",
    "ท่านมีโอกาสไดเพักผ้อนคลายเครียดมากน้อยเพียงใด",
    "สภาพแวดล้อมดีต่อสุขภาพของท่านมากน้อยเพียงใด",
    "ท่านพอใจกับการเดินทางไปไหนมาไหนของท่าน(หมายถึงการคมนาคม) มากน้อยเพียงใด",
    "ท่านรู้สึกว่าชีวิตท่านมีความหมายมากน้อยแค่ไหน",
    "ท่านสามารถไปไหนมาไหนด้วยตนเองได้ดีเพียงใด",
    "ท่านพอใจในชีวิตทางเพศของท่านแค่ไหน(ชีวิตทางเพศ หมายถึงเมื่อเกิดความรู้สึกทางเพศขึ้นแล้วท่าน\nมีวิธีจัดการทำให้ผ่อนคลายลงได้รวมถึงการช่วยตัวเองหรือการมีเพศสัมพันธ์)",
    "ท่านคิดว่าท่านมีคุณภาพชีวิต (ชีวิตความเป็นอยู่)อยู่ในระดับใด"
]
buttongroup2 = [("ไม่เลย", 5 , 'red'), ("เล็กน้อย", 4 ,'orange'), ("ปานกลาง", 3 , 'yellow'), ("มาก", 2 , 'green'), ("มากที่สุด", 1 , 'lightblue')]
buttongroup1 = [("ไม่เลย", 1 , 'red'), ("เล็กน้อย", 2 ,'orange'), ("ปานกลาง", 3 , 'yellow'), ("มาก", 4 , 'green'), ("มากที่สุด", 5 , 'lightblue')]

show = StringVar(value="0")
show.set(0)


def main(number: int):
 global score
 score = score + number
 question.set(question.get() + 1)


def equal():
 cal = str(score)
 show.set(cal)
 
 if int(cal) >= 26 and int(cal) <= 60:
 lbs=Label(text='คุณภาพชีวิตไม่ดี', font="40",bg='red').grid(row=2,column=2)
 elif int(cal) >=61 and int(cal) <= 95:
 lbs=Label(text='คุณภาพชีวิตปลานกลาง', font="40",bg='orange').grid(row=2,column=2)
 elif int(cal) >=96:
 lbs=Label(text='คุณภาพชีวิตที่ดี', font="40",bg='lightgreen').grid(row=2,column=2)

btn = []
while question.get() < 26:
 lb1 = Label(text=q[question.get()], font="40",width=100,bg='grey')
 lb1.grid(row=0,columnspan=5)
 if q[question.get()]=="การเจ็บปวดตามร่างกายเช่น ปวดหัว ปวดท้อง ปวดตามตัว ทําให้ท่านไมสามารถทำในสิ่งทิ่ต้องการมากน้อยเพียงใด" or q[question.get()]=="ท่านมีความรู้สึกไม่ดีเช่น รู้สึกเหงาเศร้า หดหู่ สิ้นหวังวิตกกังวล บ่อยแค่ไหน" or q[question.get()]== "ท่านจําเป็นต้องไปรับการรักษาพยาบาลมากน้อยเพียงใดเพื่อที่จะทํางานหรือมีชีวิตอยู่ไปได้ในแต่ละวัน":
 for index, button in enumerate(buttongroup2):
 (text, n,co) = button
 x=Button(text=text, command=partial(main, n),bg=co)
 x.grid(row=1, column=index)
 btn.append(x)
 else:
 for index, button in enumerate(buttongroup1):
 (text, n,co) = button
 x=Button(text=text, command=partial(main, n),bg=co)
 x.grid(row=1, column=index)
 btn.append(x)
 lb1.wait_variable(question)
 lb1.destroy()
 for button in btn:
 button.destroy()
 
en_all_end = Button(text="เสร็จสิ้น", command=equal).grid(row=2, column=0)
lb1 = Label(textvariable=show, font="40").grid(row=2, column=1)

root.mainloop()
